{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\rober\OneDrive\Documents\Stata\log_EFH.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}30 Aug 2023, 18:51:59
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. use EFH_2017_base_noimputada.dta, clear 
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. codebook f1_t1

{txt}{hline}
{res}f1_t1{right:¿Tiene Ud. o algún otro miembro del hogar deuda en tarjeta de crédito bancario?}
{txt}{hline}

{col 19}Type: Numeric ({res}double{txt})
{ralign 22:Label}: {res:f1_t1}

{col 18}Range: [{res}1{txt},{res}9{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}4{col 51}{txt}Missing .: {res}9,758{txt}/{res}14,307

{txt}{col 13}Tabulation: Freq.   Numeric  Label
{col 20}{res}       996{col 32}       1{col 42}{txt}Si
{col 20}{res}     3,545{col 32}       2{col 42}{txt}No
{col 20}{res}         2{col 32}       8{col 42}{txt}No responde
{col 20}{res}         6{col 32}       9{col 42}{txt}No sabe
{col 20}{res}     9,758{col 32}       .{col 42}
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. gen n_deudas_bancarias = f2_t1 if f1_t1 == 1
{txt}(13,311 missing values generated)

{com}. 
{txt}end of do-file

{com}. browse

. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. replace n_deudas_bancarias = 0 if f1_t1 == 2
{txt}(3,545 real changes made)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. gen n_deudas_comerciales = f2_t3 if f1_t3 == 1
{txt}(12,867 missing values generated)

{com}. replace n_deudas_comerciales = 0 if f1_t3 == 2
{txt}(3,091 real changes made)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. gen n_deudas_totales = n_deudas_bancarias + n_deudas_comerciales
{txt}(9,783 missing values generated)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. keep if n_deudas_bancarias!=. & n_deudas_comerciales~=. & n_deudas_totales~=.
{txt}(9,783 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. sum(n_deudas_totales)

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
n_deudas_t~s {c |}{res}      4,524    .8435013    1.394947          0         21
{txt}
{com}. sum(n_deudas_bancarias)

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
n_deudas_b~s {c |}{res}      4,524    .3183024    .7624919          0         20
{txt}
{com}. sum(n_deudas_comerciales)

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
n_deudas_c~s {c |}{res}      4,524    .5251989    1.024585          0         20
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. replace ytotef=ytotef/1000000
{txt}(3,399 real changes made)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. ***** TALLER 2 DE STATA
. ** Regresiones
. *****
. clear
{txt}
{com}. ** PREGUNTA 1)
. clear
{txt}
{com}. cd  "/Users/vivianadiaztitelman/Desktop/ECONOMIA PUC/AYUDANTIAS/Stata 2022-1"
{err}unable to change to /Users/vivianadiaztitelman/Desktop/ECONOMIA PUC/AYUDANTIAS/Stata 2022-1
{txt}{search r(170), local:r(170);}

end of do-file

{search r(170), local:r(170);}

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. sum(ytotef)
{err}no variables defined
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. replace ytotef=ytotef/1000000
{err}no variables defined
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. sum(ytotef)
{err}no variables defined
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. Sum(ytotef)
{err}command {bf}Sum{sf} is unrecognized
{txt}{search r(199), local:r(199);}

end of do-file

{search r(199), local:r(199);}

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. global DEUDAS n_deudas_bancarias n_deudas_comerciales n_deudas_totales
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. reg n_deudas_bancarias ytotef
{err}no variables defined
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. log using log_EFH.smcl, replace
{err}log file already open
{txt}{search r(604), local:r(604);}

end of do-file

{search r(604), local:r(604);}

{com}. browse

. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. codebook f1_t1
{err}no variables defined
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. use EFH_2017_base_noimputada.dta, clear 
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. gen n_deudas_bancarias = f2_t1 if f1_t1 == 1
{txt}(13,311 missing values generated)

{com}. replace n_deudas_bancarias = 0 if f1_t1 == 2
{txt}(3,545 real changes made)

{com}. 
. codebook f1_t3

{txt}{hline}
{res}f1_t3{right:¿Tiene Ud. o algún otro miembro del hogar deuda en tarjetas de casas comerciales}
{txt}{hline}

{col 19}Type: Numeric ({res}double{txt})
{ralign 22:Label}: {res:f1_t3}

{col 18}Range: [{res}1{txt},{res}9{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}4{col 51}{txt}Missing .: {res}9,758{txt}/{res}14,307

{txt}{col 13}Tabulation: Freq.   Numeric  Label
{col 20}{res}     1,440{col 32}       1{col 42}{txt}Si
{col 20}{res}     3,091{col 32}       2{col 42}{txt}No
{col 20}{res}         3{col 32}       8{col 42}{txt}No responde
{col 20}{res}        15{col 32}       9{col 42}{txt}No sabe
{col 20}{res}     9,758{col 32}       .{col 42}
{txt}
{com}. gen n_deudas_comerciales = f2_t3 if f1_t3 == 1
{txt}(12,867 missing values generated)

{com}. replace n_deudas_comerciales = 0 if f1_t3 == 2
{txt}(3,091 real changes made)

{com}. 
. gen n_deudas_totales = n_deudas_bancarias + n_deudas_comerciales
{txt}(9,783 missing values generated)

{com}. 
. keep if n_deudas_bancarias!=. & n_deudas_comerciales~=. & n_deudas_totales~=.
{txt}(9,783 observations deleted)

{com}. 
. sum(n_deudas_totales)

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
n_deudas_t~s {c |}{res}      4,524    .8435013    1.394947          0         21
{txt}
{com}. sum(n_deudas_bancarias)

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
n_deudas_b~s {c |}{res}      4,524    .3183024    .7624919          0         20
{txt}
{com}. sum(n_deudas_comerciales)

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
n_deudas_c~s {c |}{res}      4,524    .5251989    1.024585          0         20
{txt}
{com}. 
. replace ytotef=ytotef/1000000
{txt}(3,399 real changes made)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. global DEUDAS n_deudas_bancarias n_deudas_comerciales n_deudas_totales
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. reg n_deudas_bancarias ytotef

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     3,441
{txt}{hline 13}{c +}{hline 34}   F(1, 3439)      = {res}   110.48
{txt}       Model {c |} {res} 69.4742438         1  69.4742438   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2162.52111     3,439  .628822654   {txt}R-squared       ={res}    0.0311
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0308
{txt}       Total {c |} {res} 2231.99535     3,440  .648835858   {txt}Root MSE        =   {res} .79298

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}n_deudas_b~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ytotef {c |}{col 14}{res}{space 2} .0332859{col 26}{space 2} .0031667{col 37}{space 1}   10.51{col 46}{space 3}0.000{col 54}{space 4}  .027077{col 67}{space 3} .0394948
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2702895{col 26}{space 2} .0148343{col 37}{space 1}   18.22{col 46}{space 3}0.000{col 54}{space 4} .2412045{col 67}{space 3} .2993745
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. foreach var of global DEUDAS{c -(}
{txt}  2{com}. display "Dos regresiones para `var'"
{txt}  3{com}. reg `var' ytotef
{txt}  4{com}. reg `var' ytotef educ_pr
{txt}  5{com}. {c )-}
Dos regresiones para n_deudas_bancarias

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     3,441
{txt}{hline 13}{c +}{hline 34}   F(1, 3439)      = {res}   110.48
{txt}       Model {c |} {res} 69.4742438         1  69.4742438   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2162.52111     3,439  .628822654   {txt}R-squared       ={res}    0.0311
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0308
{txt}       Total {c |} {res} 2231.99535     3,440  .648835858   {txt}Root MSE        =   {res} .79298

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}n_deudas_b~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ytotef {c |}{col 14}{res}{space 2} .0332859{col 26}{space 2} .0031667{col 37}{space 1}   10.51{col 46}{space 3}0.000{col 54}{space 4}  .027077{col 67}{space 3} .0394948
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2702895{col 26}{space 2} .0148343{col 37}{space 1}   18.22{col 46}{space 3}0.000{col 54}{space 4} .2412045{col 67}{space 3} .2993745
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,019
{txt}{hline 13}{c +}{hline 34}   F(2, 2016)      = {res}    81.06
{txt}       Model {c |} {res} 107.344978         2  53.6724891   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1334.84521     2,016  .662125603   {txt}R-squared       ={res}    0.0744
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0735
{txt}       Total {c |} {res} 1442.19019     2,018  .714663128   {txt}Root MSE        =   {res} .81371

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}n_deudas_b~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ytotef {c |}{col 14}{res}{space 2} .0294554{col 26}{space 2} .0048178{col 37}{space 1}    6.11{col 46}{space 3}0.000{col 54}{space 4} .0200071{col 67}{space 3} .0389037
{txt}{space 5}educ_pr {c |}{col 14}{res}{space 2} .0397126{col 26}{space 2} .0044357{col 37}{space 1}    8.95{col 46}{space 3}0.000{col 54}{space 4} .0310135{col 67}{space 3} .0484117
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.2775299{col 26}{space 2} .0635594{col 37}{space 1}   -4.37{col 46}{space 3}0.000{col 54}{space 4}-.4021789{col 67}{space 3}-.1528809
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Dos regresiones para n_deudas_comerciales

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     3,441
{txt}{hline 13}{c +}{hline 34}   F(1, 3439)      = {res}     1.88
{txt}       Model {c |} {res} 2.05142448         1  2.05142448   {txt}Prob > F        ={res}    0.1708
{txt}    Residual {c |} {res} 3758.71231     3,439  1.09296665   {txt}R-squared       ={res}    0.0005
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0003
{txt}       Total {c |} {res} 3760.76373     3,440  1.09324527   {txt}Root MSE        =   {res} 1.0455

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}n_deudas_c~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ytotef {c |}{col 14}{res}{space 2}-.0057197{col 26}{space 2}  .004175{col 37}{space 1}   -1.37{col 46}{space 3}0.171{col 54}{space 4}-.0139054{col 67}{space 3} .0024659
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5576764{col 26}{space 2} .0195572{col 37}{space 1}   28.52{col 46}{space 3}0.000{col 54}{space 4} .5193315{col 67}{space 3} .5960213
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,019
{txt}{hline 13}{c +}{hline 34}   F(2, 2016)      = {res}     1.33
{txt}       Model {c |} {res} 2.58834694         2  1.29417347   {txt}Prob > F        ={res}    0.2658
{txt}    Residual {c |} {res} 1967.57213     2,016  .975978238   {txt}R-squared       ={res}    0.0013
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0003
{txt}       Total {c |} {res} 1970.16048     2,018  .976293595   {txt}Root MSE        =   {res} .98792

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}n_deudas_c~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ytotef {c |}{col 14}{res}{space 2} -.006754{col 26}{space 2} .0058492{col 37}{space 1}   -1.15{col 46}{space 3}0.248{col 54}{space 4} -.018225{col 67}{space 3} .0047171
{txt}{space 5}educ_pr {c |}{col 14}{res}{space 2}-.0041469{col 26}{space 2} .0053854{col 37}{space 1}   -0.77{col 46}{space 3}0.441{col 54}{space 4}-.0147084{col 67}{space 3} .0064145
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .554579{col 26}{space 2} .0771667{col 37}{space 1}    7.19{col 46}{space 3}0.000{col 54}{space 4} .4032442{col 67}{space 3} .7059137
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Dos regresiones para n_deudas_totales

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     3,441
{txt}{hline 13}{c +}{hline 34}   F(1, 3439)      = {res}    23.08
{txt}       Model {c |} {res} 47.6492226         1  47.6492226   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 7098.73671     3,439  2.06418631   {txt}R-squared       ={res}    0.0067
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0064
{txt}       Total {c |} {res} 7146.38593     3,440  2.07743777   {txt}Root MSE        =   {res} 1.4367

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}n_deudas_t~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ytotef {c |}{col 14}{res}{space 2} .0275662{col 26}{space 2} .0057375{col 37}{space 1}    4.80{col 46}{space 3}0.000{col 54}{space 4} .0163169{col 67}{space 3} .0388154
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8279659{col 26}{space 2} .0268768{col 37}{space 1}   30.81{col 46}{space 3}0.000{col 54}{space 4} .7752698{col 67}{space 3} .8806621
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,019
{txt}{hline 13}{c +}{hline 34}   F(2, 2016)      = {res}    20.48
{txt}       Model {c |} {res} 77.9621797         2  38.9810899   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3837.96947     2,016   1.9037547   {txt}R-squared       ={res}    0.0199
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0189
{txt}       Total {c |} {res} 3915.93165     2,018  1.94050131   {txt}Root MSE        =   {res} 1.3798

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}n_deudas_t~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ytotef {c |}{col 14}{res}{space 2} .0227014{col 26}{space 2} .0081692{col 37}{space 1}    2.78{col 46}{space 3}0.006{col 54}{space 4} .0066804{col 67}{space 3} .0387224
{txt}{space 5}educ_pr {c |}{col 14}{res}{space 2} .0355657{col 26}{space 2} .0075214{col 37}{space 1}    4.73{col 46}{space 3}0.000{col 54}{space 4} .0208151{col 67}{space 3} .0503163
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .277049{col 26}{space 2} .1077743{col 37}{space 1}    2.57{col 46}{space 3}0.010{col 54}{space 4} .0656884{col 67}{space 3} .4884096
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\rober\AppData\Local\Temp\STD2288_000000.tmp"
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\rober\OneDrive\Documents\Stata\log_EFH.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}30 Aug 2023, 19:34:20
{txt}{.-}
{smcl}
{txt}{sf}{ul off}